modm-ext/archive-stmicro-svd/header_stm32f765bgt6.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MDIOS</name>
      <baseAddress>0x40017800</baseAddress>
      <registers>
        <register>
          <name>CR</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRIE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDIE</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EIE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DPC</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PORT_ADDRESS</name>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WRFR</name>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WRF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CWRFR</name>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CWRF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDFR</name>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RDF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRDFR</name>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CRDF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PERF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TERF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLRFR</name>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CPERF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSERF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTERF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DINR0</name>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR1</name>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR2</name>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR3</name>
          <addressOffset>0x10c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR4</name>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR5</name>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR6</name>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR7</name>
          <addressOffset>0x11c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR8</name>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR9</name>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR10</name>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR11</name>
          <addressOffset>0x12c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR12</name>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR13</name>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR14</name>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR15</name>
          <addressOffset>0x13c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR16</name>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR17</name>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR18</name>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR19</name>
          <addressOffset>0x14c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR20</name>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR21</name>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR22</name>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR23</name>
          <addressOffset>0x15c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR24</name>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR25</name>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR26</name>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR27</name>
          <addressOffset>0x16c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR28</name>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR29</name>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR30</name>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR31</name>
          <addressOffset>0x17c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR0</name>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR1</name>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR2</name>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR3</name>
          <addressOffset>0x18c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR4</name>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR5</name>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR6</name>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR7</name>
          <addressOffset>0x19c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR8</name>
          <addressOffset>0x1a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR9</name>
          <addressOffset>0x1a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR10</name>
          <addressOffset>0x1a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR11</name>
          <addressOffset>0x1ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR12</name>
          <addressOffset>0x1b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR13</name>
          <addressOffset>0x1b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR14</name>
          <addressOffset>0x1b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR15</name>
          <addressOffset>0x1bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR16</name>
          <addressOffset>0x1c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR17</name>
          <addressOffset>0x1c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR18</name>
          <addressOffset>0x1c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR19</name>
          <addressOffset>0x1cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR20</name>
          <addressOffset>0x1d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR21</name>
          <addressOffset>0x1d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR22</name>
          <addressOffset>0x1d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR23</name>
          <addressOffset>0x1dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR24</name>
          <addressOffset>0x1e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR25</name>
          <addressOffset>0x1e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR26</name>
          <addressOffset>0x1e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR27</name>
          <addressOffset>0x1ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR28</name>
          <addressOffset>0x1f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR29</name>
          <addressOffset>0x1f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR30</name>
          <addressOffset>0x1f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR31</name>
          <addressOffset>0x1fc</addressOffset>
          <size>0x20</size>
        </register>
